app/controllers/articles_controller.rb

  def create
    @article = Article.new(article_params)

    if @article.save
---
INSERT INTO "articles" ("title", "body", "published_at", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["title", ""], ["body", ""], ["published_at", "2017-04-10 14:45:00.000000"], ["created_at", "2017-04-10 14:45:51.600280"], ["updated_at", "2017-04-10 14:45:51.600280"]]